app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    if @post = Post.create(post_params)

UPDATE "posts" SET "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "Working Out!"], ["updated_at", "2016-02-13 22:03:36.126396"], ["id", 1]]
---
  def update
    if @post.update(post_params)